interface Person {
  type: string;
  name: string;
  disposition: string;
  characteristic: string;
}
export const PERSON: Person[] = [
  {
    type: "ESJ",
    name: "마르다",
    disposition:
      "사교적이고 실질적이며, 타인의 감정을 잘 이해하고 돌보는 성향이 있습니다.",
    characteristic:
      "마르다는 예수님을 집에 초대하고 대접하며, 가족과 친구들을 돌보는 모습을 보여줍니다. 그녀는 집안일을 열심히 하고, 손님을 대접하는 데 있어 세심한 주의를 기울입니다. 그녀의 실질적인 접근 방식과 조직력은 모든 일이 잘 되도록 보장합니다.",
  },
  {
    type: "ESP",
    name: "베드로",
    disposition:
      "활발하고 현실적이며, 새로운 경험을 즐기고 즉흥적으로 행동하는 성향이 있습니다.",
    characteristic:
      "베드로는 예수님의 제자로서 다양한 사역을 수행하며, 순간의 기회를 포착하고 즉흥적으로 행동하는 모습을 보여줍니다. 그는 종종 빠른 결정을 내리고 행동하며, 물 위를 걷는 등의 도전적인 상황에서도 두려움 없이 나아갑니다. 또한 새로운 사역과 전도의 기회를 기꺼이 받아들입니다.",
  },
  {
    type: "ENJ",
    name: "바울",
    disposition:
      "활동적이고 통찰력이 있으며, 리더십을 발휘하고 목표 지향적입니다.",
    characteristic:
      "바울은 전도여행을 통해 복음을 전하며, 교회를 세우고 지도하는 모습을 보여줍니다. 그는 전략적으로 계획을 세우고, 각 지역의 문화와 상황을 이해하며 접근합니다. 또한, 그는 서신을 통해 교회를 이끌고 교육하며, 미래의 비전을 제시합니다.",
  },
  {
    type: "ENP",
    name: "바나바",
    disposition:
      "활발하고 창의적이며, 새로운 가능성을 탐색하고 적응력이 뛰어납니다.",
    characteristic:
      "바나바는 초기 교회에서 많은 사람들을 격려하고, 복음을 전파하며 변화와 도전에 잘 적응하는 모습을 보여줍니다. 그는 사람들을 모으고 격려하는 데 뛰어나며, 다양한 환경에서 유연하게 대처하며 사역을 진행합니다. 또한, 새로운 아이디어와 방법을 통해 복음을 전파하려고 노력합니다.",
  },
  {
    type: "INJ",
    name: "다니엘",
    disposition:
      "내향적이고 직관적이며, 비전과 이상을 추구하는 성향이 있습니다.",
    characteristic:
      "다니엘은 꿈을 해석하고 예언하며, 하나님의 계획을 따르는 모습을 보여줍니다. 그는 바벨론에서 높은 지위에 오르며, 왕들의 꿈을 해석하고, 미래의 사건들을 예언합니다. 그의 통찰력과 예지력은 그와 그의 민족을 보호하고 인도하는 데 큰 역할을 합니다.",
  },
  {
    type: "INP",
    name: "요한",
    disposition:
      "창의적이고 상상력이 풍부하며, 개방적이고 유연한 성향이 있습니다.",
    characteristic:
      "요한은 요한계시록을 통해 환상을 기록하고, 하나님의 계시를 전달하는 모습을 보여줍니다. 그는 깊은 영적 통찰력을 바탕으로 복잡한 비전과 상징을 이해하고 전달합니다. 그의 창의성과 개방성은 요한복음과 요한서신에서도 드러나며, 깊은 신학적 사색과 영적 메시지를 전달합니다.",
  },
  {
    type: "ISJ",
    name: "요셉",
    disposition: "신중하고 현실적이며, 책임감이 강하고 전통을 중시합니다.",
    characteristic:
      "요셉은 마리아와 예수님을 돌보고 보호하며, 꿈을 통해 하나님의 지시를 따르는 모습을 보여줍니다. 그는 가족을 보호하기 위해 위험을 감수하며, 하나님의 명령을 충실히 따릅니다. 그의 신중함과 책임감은 예수님의 어린 시절을 안전하게 지키는 데 중요한 역할을 합니다.",
  },
  {
    type: "ISP",
    name: "사무엘",
    disposition: "조용하고 관찰력이 뛰어나며, 상황에 따라 유연하게 대처합니다.",
    characteristic:
      "사무엘은 하나님의 음성을 듣고 이스라엘의 사사로서 활동하며, 신중하고 유연하게 행동하는 모습을 보여줍니다. 그는 어린 시절부터 하나님과의 깊은 관계를 유지하며, 이스라엘 백성의 요구와 하나님의 뜻을 조율합니다. 그의 유연성과 신중함은 이스라엘을 안정시키는 데 중요한 역할을 합니다.",
  },
];
